; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v4)
		(pred_3 ?v1)
		(pred_2 ?v3)
		(pred_6 ?v3)
		(pred_5 ?v1 ?v3)
		(pred_1)
		(pred_4 ?v1))

   (:action op_2
       :parameters  (?v7 ?v8)
       :precondition (and (not-eq ?v7 ?v8) 
                          (pred_2 ?v7) (pred_2 ?v8) (pred_6 ?v7))
       :effect (and  (pred_6 ?v8)
		     (not (pred_6 ?v7))))


   (:action op_1
       :parameters (?v2 ?v5)
       :precondition  (and  (pred_3 ?v2) (pred_2 ?v5)
			    (pred_5 ?v2 ?v5) (pred_6 ?v5) (pred_1))
       :effect (and (pred_4 ?v2)
		    (not (pred_5 ?v2 ?v5)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v2  ?v5)
       :precondition  (and  (pred_3 ?v2) (pred_2 ?v5)
			    (pred_4 ?v2) (pred_6 ?v5))
       :effect (and (pred_5 ?v2 ?v5)
		    (pred_1)
		    (not (pred_4 ?v2)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_06 obj_05 obj_02 obj_01 
          obj_03 obj_04 
)
(:init
(pred_2 obj_06)
(pred_2 obj_05)
(pred_2 obj_02)
(pred_2 obj_01)
(pred_3 obj_03)
(pred_3 obj_04)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(pred_1)
(pred_5 obj_03 obj_01)
(pred_5 obj_04 obj_01)
(pred_6 obj_05)
)
(:goal
(and
(pred_5 obj_03 obj_01)
(pred_5 obj_04 obj_05)
)
)

(:constraints
  (sometime-before  (pred_5 obj_04 obj_05) (pred_6 obj_06))
)
)

; plan
1. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 1 of 2
2. (op_1 obj_03 obj_01)
   deleted: (pred_5 obj_03 obj_01) (pred_1)
   added: (pred_4 obj_03)
   goals met: 0 of 2
3. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_06)
   goals met: 0 of 2
4. (op_3 obj_03 obj_06)
   deleted: (pred_4 obj_03)
   added: (pred_5 obj_03 obj_06) (pred_1)
   goals met: 0 of 2
5. (op_2 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_1 obj_04 obj_01)
   deleted: (pred_5 obj_04 obj_01) (pred_1)
   added: (pred_4 obj_04)
   goals met: 0 of 2
7. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 2
8. (op_3 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_5 obj_04 obj_05) (pred_1)
   goals met: 1 of 2
9. (op_2 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_06)
   goals met: 1 of 2
10. (op_1 obj_03 obj_06)
   deleted: (pred_5 obj_03 obj_06) (pred_1)
   added: (pred_4 obj_03)
   goals met: 1 of 2
11. (op_2 obj_06 obj_01)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_01)
   goals met: 1 of 2
12. (op_3 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_5 obj_03 obj_01) (pred_1)
   goals met: 2 of 2
